{
    "name": "Rupali Vaishnav",
    "designation": "Experienced Full-Stack Developer",
    "description": "Results-driven software engineer with a five-year track record in designing, developing, and optimizing robust applications. Excels in development, collaborative team leadership, and staying at the forefront of evolving technologies. Eager to contribute a wealth of experience to dynamic projects and drive the success of forward-thinking teams.",
    "link": "",
    "mail": "rups252504@gmail.com",
    "mobile": "8602382196",
    "location": "Bangalore, India",
    "social": [
        {
            "text": "rupali-vaishnav-b27b311a4",
            "title": "LinkedIn",
            "link": "https://www.linkedin.com/in/rupali-vaishnav-b27b311a4/"
        },
        {
            "text": "Rupali2523",
            "title": "GitHub",
            "link": "https://github.com/Rupali2523"
        }
    ],
    "skills": [
        {
            "Frontend Development": [
                {
                    "title": "ReactJS",
                    "description": "Advanced proficiency in building dynamic, responsive web applications."
                },
                {
                    "title": "JavaScript",
                    "description": "Proficient in writing clean, maintainable, and efficient code."
                },
                {
                    "title": "HTML5 & CSS3",
                    "description": "Strong foundation in modern web standards and crafting visually appealing designs."
                },
                {
                    "title": "Bootstrap",
                    "description": "Experienced in utilizing frameworks to expedite and standardize development."
                },
                {
                    "title": "TypeScript",
                    "description": "Skilled in adding type safety to JavaScript, enhancing code quality and maintainability."
                }
            ]
        },
        {
            "Full-Stack Development": [
                {
                    "title": "UI/UX Design",
                    "description": "Expertise in creating intuitive and user-centric designs."
                },
                {
                    "title": "Responsive Design",
                    "description": "Experience in developing applications that work seamlessly across various devices and screen sizes."
                },
                {
                    "title": "RESTful APIs",
                    "description": "Skilled in integrating and developing RESTful services for robust data exchange."
                },
                {
                    "title": "Redux",
                    "description": "Proficient in managing application state effectively."
                },
                {
                    "title": "Agile Methodologies",
                    "description": "Experience in iterative development processes for continuous improvement."
                },
                {
                    "title": "Git Version Control",
                    "description": "Experienced in using version control for efficient code management and collaboration."
                }
            ]
        }
    ],
    "experience": {
        "icon": "business_center",
        "title": "EXPERIENCE",
        "data": [
            {
                "company": "CL Infotech Pvt. Ltd - (HASPR Client)",
                "duration": "06/2020 - 11/2023",
                "designation": "Frontend Developer",
                "location": "Bangalore",
                "description": "At CL Infotech, I played a key role in designing and developing user interfaces and experiences for diverse projects, focusing on delivering intuitive and high-performance applications. My responsibilities included leading the development of reusable UI components, optimizing frontend performance, and ensuring responsive design across platforms.",
                "tech_stack": [
                    "ReactJs",
                    "Javascript",
                    "Redux"
                ],
                "projects": [
                    {
                        "title": "CL Infotech - HASPR Client",
                        "link": "",
                        "description": [
                            "Integral part of the team responsible for designing and developing the user interface and user experience for the Haspr website.",
                            "Focused on creating an intuitive, visually appealing, and responsive frontend using HTML5, CSS3, JavaScript (ES6+), and ReactJs.",
                            "Led the development of reusable and modular UI components, enhancing development efficiency, maintainability, and consistent design patterns.",
                            "Implemented frontend optimization best practices to enhance website performance and loading speed, resulting in improved user satisfaction."
                        ]
                    },
                    {
                        "title": "Comment Module - React.js Project",
                        "link": "",
                        "description": [
                            "Led the development and implementation of a comprehensive comment module within a React.js application, improving code readability and maintainability.",
                            "Implemented industry best practices for code documentation using JavaScript comment syntax, facilitating seamless teamwork and knowledge transfer.",
                            "Key contributor to code reviews, receiving positive feedback for improving code comprehension and reducing onboarding time for new developers."
                        ]
                    },
                    {
                        "title": "Transactional Dashboard - React.js Project",
                        "link": "",
                        "description": [
                            "Spearheaded the development of a dynamic Transactional Dashboard using React.js, collaborating closely with cross-functional teams for a responsive and user-friendly interface.",
                            "Utilized React.js for building modular and reusable components, integrated RESTful APIs, and implemented data visualization tools for actionable insights.",
                            "Applied state management solutions, such as Redux, ensuring a seamless user experience and contributing to the project's success."
                        ]
                    },
                    {
                        "title": "UI Library Development - React.js Project",
                        "link": "",
                        "description": [
                            "Led the conceptualization, design, and development of a reusable UI library in React.js, streamlining UI development across multiple projects.",
                            "Collaborated with UX/UI designers to create a cohesive design system, implemented a range of customizable React components, and utilized Storybook for documentation.",
                            "Conducted usability testing and gathered feedback, improving user satisfaction and development efficiency."
                        ]
                    }
                ]
            },
            {
                "company": "TCS",
                "duration": "04/2016 - 04/2018",
                "designation": "ASE - Assistant Software Engineer",
                "location": "Mumbai",
                "description": "At TCS, I contributed to the development and quality assurance of banking applications, focusing on ensuring security, accuracy, and compliance. My role involved formulating test strategies, managing test data, and leading testing efforts to ensure the successful deployment of complex applications.",
                "projects": [
                    {
                        "title": "TCS - CIBC",
                        "link": "",
                        "description": [
                            "Spearheaded testing and quality assurance for a complex banking application, ensuring security, accuracy, and reliability.",
                            "Formulated comprehensive test strategies, developed detailed test plans, and orchestrated test data management for various scenarios.",
                            "Contributed to the successful deployment of the application, meeting regulatory compliance and enhancing customer satisfaction."
                        ]
                    }
                ]
            },
            {
                "company": "Test Yantra - (Client - Tekion Pvt Ltd)",
                "duration": "02/2024 - 09/2024",
                "designation": "Senior Software Engineer",
                "location": "Bangalore",
                "description": "In my role at Test Yantra, I worked on enhancing and developing features for Tekion's financial management platforms. My focus was on creating highly interactive and user-friendly interfaces for accounting and payroll systems, contributing to both backend and frontend development efforts.",
                "tech_stack": [
                    "ReactJs",
                    "Javascript",
                    "Redux"
                ],
                "projects": [
                    {
                        "title": "Tekion Accounting",
                        "link": "",
                        "description": [
                            "As a frontend developer, I also worked on Tekion Accounting, an accounting management platform, utilizing React and JavaScript. My contributions were centered on creating a seamless and highly interactive user experience.",
                            "Accounts Receivable Invoice: Designed the UI for managing customer invoices and tracking payment statuses.",
                            "Accounts Payable Invoice: Developed interfaces to handle vendor invoices and streamline the payment process.",
                            "Payments Processing: Worked on the payment management screens to facilitate smooth transaction flows and reconciliation. This project aimed to simplify financial management tasks while providing a modern and efficient interface for accountants and financial managers."
                        ]
                    },
                    {
                        "title": "Tekion Payrole",
                        "link": "",
                        "description": [
                            "I contributed as a frontend developer on Tekion Payroll, a comprehensive payroll management system. The application was built using React and JavaScript, focusing on a smooth and responsive user interface.",
                            "Login/Logout Functionality: Implemented secure authentication mechanisms for employees and administrators.",
                            "Time Management Module: Built an intuitive interface for tracking working hours, breaks, and overtime.",
                            "Employee Sheets: Developed dynamic forms and data tables for managing employee information, including work hours and salary data.",
                            "Employee Hours Tracking: Created a real-time hour tracking system to ensure payroll accuracy. The project was aimed at enhancing payroll operations while ensuring a user-friendly experience for both employees and administrators."
                        ]
                    }
                ]
            }
        ]
    },
    "education": {
        "title": "EDUCATION",
        "icon": "school",
        "data": [
            {
                "class": "M.Tech",
                "institute": "Maulana Azad National Institute of Technology (MANIT) - Bhopal",
                "duration": "07/2018 - 06/2020",
                "location": "Bhopal"
            },
            {
                "class": "B.E.",
                "institute": "University Institute of Technology - RGPV - Bhopal",
                "duration": "07/2011 - 06/2015",
                "location": "Bhopal"
            }
        ]
    },
    "rewards": {
        "title": "REWARDS",
        "icon": "social_leaderboard",
        "data": [
            {
                "title": "Talent Density Pitstop (TDP) Program Recognition",
                "description": "Recognized as a top talent in the TDP program for consistently surpassing expectations and making substantial contributions to team success, showcasing exceptional skills and dedication."
            }
        ]
    },
    "interests": {
        "title": "INTERESTS",
        "icon": "sprint",
        "data": [
            "Artificial Intelligence",
            "Travelling",
            "Bike Riding",
            "Painting",
            "Intercultural Exchange"
        ]
    }
}