{
    "name": "Rupali Vaishnav",
    "designation": "Experienced Full-Stack Developer",
    "description": "Results-driven software engineer with a five-year track record in designing, developing, and optimizing robust applications. Excels in development, collaborative team leadership, and staying at the forefront of evolving technologies. Eager to contribute a wealth of experience to dynamic projects and drive the success of forward-thinking teams.",
    "mail": "rups252504@gmail.com",
    "mobile": "8602382196",
    "location": "Bangalore, India",
    "img_url": "",
    "social": [
        {
            "title": "LinkedIn",
            "icon": "linkedin",
            "link": "https://www.linkedin.com/in/rupali-vaishnav-b27b311a4/"
        },
        {
            "title": "GitHub",
            "icon": "github",
            "link": "https://github.com/Rupali2523"
        }
    ],
    "skills": [
        "ReactJS",
        "Javascript",
        "CSS",
        "HTML",
        "Bootstrap",
        "Typescript",
        "Web Development",
        "UI/UX",
        "Full-Stack Development",
        "Responsive Design",
        "RESTful APIs",
        "Redux",
        "Agile Methodologies",
        "Git Version Control"
    ],
    "education": {
        "title": "Reward",
        "icon": "social_leaderboard",
        "data": [
            {
                "class": "M.Tech",
                "institute": "Maulana Azad National Institute of Technology (MANIT) - Bhopal",
                "duration": "07/2018 - 06/2020",
                "location": "Bhopal"
            },
            {
                "class": "B.E.",
                "institute": "University Institute of Technology - RGPV - Bhopal",
                "duration": "07/2011 - 06/2015",
                "location": "Bhopal"
            }
        ]
    },
    "experience": {
        "icon": "business_center",
        "title": "EXPERIENCE",
        "data": [
            {
                "company": "CL Infotech Pvt. Ltd - (HASPR Client)",
                "duration": "06/2020 - 11/2023",
                "designation": "Frontend Developer",
                "location": "Bangalore",
                "tech_stack": [
                    "ReactJs",
                    "Javascript",
                    "Redux"
                ],
                "projects": [
                    {
                        "title": "CL Infotech - HASPR Client",
                        "link": "",
                        "description": [
                            "Integral part of the team responsible for designing and developing the user interface and user experience for the Haspr website.",
                            "Focused on creating an intuitive, visually appealing, and responsive frontend using HTML5, CSS3, JavaScript (ES6+), and ReactJs.",
                            "Led the development of reusable and modular UI components, enhancing development efficiency, maintainability, and consistent design patterns.",
                            "Implemented frontend optimization best practices to enhance website performance and loading speed, resulting in improved user satisfaction."
                        ]
                    },
                    {
                        "title": "Comment Module - React.js Project",
                        "link": "",
                        "description": [
                            "Led the development and implementation of a comprehensive comment module within a React.js application, improving code readability and maintainability.",
                            "Implemented industry best practices for code documentation using JavaScript comment syntax, facilitating seamless teamwork and knowledge transfer.",
                            "Key contributor to code reviews, receiving positive feedback for improving code comprehension and reducing onboarding time for new developers."
                        ]
                    },
                    {
                        "title": "Transactional Dashboard - React.js Project",
                        "link": "",
                        "description": [
                            "Spearheaded the development of a dynamic Transactional Dashboard using React.js, collaborating closely with cross-functional teams for a responsive and user-friendly interface.",
                            "Utilized React.js for building modular and reusable components, integrated RESTful APIs, and implemented data visualization tools for actionable insights.",
                            "Applied state management solutions, such as Redux, ensuring a seamless user experience and contributing to the project's success."
                        ]
                    },
                    {
                        "title": "UI Library Development - React.js Project",
                        "link": "",
                        "description": [
                            "Led the conceptualization, design, and development of a reusable UI library in React.js, streamlining UI development across multiple projects.",
                            "Collaborated with UX/UI designers to create a cohesive design system, implemented a range of customizable React components, and utilized Storybook for documentation.",
                            "Conducted usability testing and gathered feedback, improving user satisfaction and development efficiency."
                        ]
                    }
                ]
            },
            {
                "company": "TCS",
                "duration": "04/2016 - 04/2018",
                "designation": "ASE - Assistant Software Engineer",
                "location": "Mumbai",
                "projects": [
                    {
                        "title": "TCS - CIBC",
                        "link": "",
                        "description": [
                            "Spearheaded testing and quality assurance for a complex banking application, ensuring security, accuracy, and reliability.",
                            "Formulated comprehensive test strategies, developed detailed test plans, and orchestrated test data management for various scenarios.",
                            "Contributed to the successful deployment of the application, meeting regulatory compliance and enhancing customer satisfaction."
                        ]
                    }
                ]
            }
        ]
    }
}